# Задание 1
# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные,
# выведите на экран.

a = 10
b = 5
c = 15
d = 2

print("Переменная a =", a)
print("Переменная b =", b)
print("Переменная c =", c)
print("Переменная d =", d)
print()

a = input("Введите новое значение переменной(число или строку) >>> ")
b = input("Введите новое значение переменной(число или строку) >>> ")
c = input("Введите новое значение переменной(число или строку) >>> ")
d = input("Введите новое значение переменной(число или строку) >>> ")

print()
print("Новое значение переменной a = ", a)
print("Новое значение переменной b = ", b)
print("Новое значение переменной c = ", c)
print("Новое значение переменной d = ", d)
